In [2]:
import pandas as pd
import numpy as np

In [3]:
people={
    'first':["eman","nada","lama","hala",np.nan,None, 'NA'],
    'last':["ali","mourad","mourad","malek",np.nan,np.nan,'missing'],
    'email':['emansamy23@gmail',"nadanada22@gmail","lama3432@gmail",None,np.nan,"anything@gmail",'NA'],
    'age':["22","33","43","23", None,None,'missing']        
}

In [4]:
df=pd.DataFrame(people)

In [5]:
df

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
3  hala    malek              None       23
4   NaN      NaN               NaN     None
5  None      NaN    anything@gmail     None
6    NA  missing                NA  missing

In [6]:
 #removes the rows that contains NULL values
df.dropna()

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
6    NA  missing                NA  missing

In [7]:
 # the same thing using default
df.dropna(axis="index",how="any")
 # here removes according to ang non value in the row

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
6    NA  missing                NA  missing

In [8]:
 # here removes according to all non value in the row
df.dropna(axis="index",how="all")

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
3  hala    malek              None       23
5  None      NaN    anything@gmail     None
6    NA  missing                NA  missing

In [9]:
 # here removes according to any non value in a specific column(first)
df.dropna(axis="index",how="any",subset=['first'])

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
3  hala    malek              None       23
6    NA  missing                NA  missing

In [10]:
 # here removes according to any non value in a specific column(email) 
df.dropna(axis="index",how="any",subset=['email'])

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
5  None      NaN    anything@gmail     None
6    NA  missing                NA  missing

In [11]:
# here removes according to any non value in a specific two columns(last , email)
df.dropna(axis="index",how="any",subset=['last','email'])

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
6    NA  missing                NA  missing

In [12]:
 # here removes according to all non value in a specific two columns(last , email)
df.dropna(axis="index",how="all",subset=['last','email'])

  first     last             email      age
0  eman      ali  emansamy23@gmail       22
1  nada   mourad  nadanada22@gmail       33
2  lama   mourad    lama3432@gmail       43
3  hala    malek              None       23
5  None      NaN    anything@gmail     None
6    NA  missing                NA  missing

In [13]:
# to make sure that every missing and na values are nan
df.replace('NA',np.nan , inplace=True)
df.replace('missing',np.nan , inplace=True)

now we will do everything again to make sure of changes

In [14]:
df

  first    last             email   age
0  eman     ali  emansamy23@gmail    22
1  nada  mourad  nadanada22@gmail    33
2  lama  mourad    lama3432@gmail    43
3  hala   malek              None    23
4   NaN     NaN               NaN  None
5  None     NaN    anything@gmail  None
6   NaN     NaN               NaN   NaN

In [15]:
df.dropna()

  first    last             email age
0  eman     ali  emansamy23@gmail  22
1  nada  mourad  nadanada22@gmail  33
2  lama  mourad    lama3432@gmail  43

In [16]:
df.dropna(axis="index",how="any",subset=['first'])

  first    last             email age
0  eman     ali  emansamy23@gmail  22
1  nada  mourad  nadanada22@gmail  33
2  lama  mourad    lama3432@gmail  43
3  hala   malek              None  23

In [17]:
 # using isna to show missing values
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [18]:
 # using isna.any to show if there missing values in columns
df.isna().any()

first    True
last     True
email    True
age      True
dtype: bool

In [24]:
 # to calculate the num of missing values in columns
df.isna().sum()

first    3
last     3
email    3
age      3
dtype: int64

In [19]:
 # filling the missing values with zeroa
df.fillna("missing")

     first     last             email      age
0     eman      ali  emansamy23@gmail       22
1     nada   mourad  nadanada22@gmail       33
2     lama   mourad    lama3432@gmail       43
3     hala    malek           missing       23
4  missing  missing           missing  missing
5  missing  missing    anything@gmail  missing
6  missing  missing           missing  missing

In [20]:
type(np.nan)

float

In [21]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [22]:
# converting the type of age column to float instead of string (number + missing values or nan)
df['age']=df['age'].astype(float)

In [23]:
df['age'].mean()

30.25